Repository: The-Binary-Rebels-Studio/Cashflow
Catalog: lib/l10n/app_*.arb
Languages: ms

# welcomeTitle
source: Welcome to CashFlow
ms: Selamat Datang ke CashFlow

# welcomeSubtitle
source: Track your expenses and manage your finances with ease
ms: Jejaki perbelanjaan anda dan urus kewangan dengan mudah

source: Get Started
ms: Mula

# onboardingChooseLanguage
source: Choose Language
ms: Pilih Bahasa

# onboardingSelectPreferredLanguage
source: Select your preferred language
ms: Pilih bahasa pilihan anda

# onboardingSkip
source: Skip
ms: Langkau

# onboardingTrackExpensesTitle
source: Track Your Expenses
ms: Jejaki Perbelanjaan Anda

# onboardingTrackExpensesSubtitle
source: Monitor your spending habits and see where your money goes
ms: Pantau tabiat perbelanjaan dan lihat ke mana wang anda pergi

# onboardingSmartCategoriesTitle
source: Smart Categories
ms: Kategori Pintar

# onboardingSmartCategoriesSubtitle
source: Organize your transactions with intelligent categorization
ms: Atur transaksi dengan pengkategorian yang bijak

# onboardingFinancialInsightsTitle
source: Financial Insights
ms: Wawasan Kewangan

# onboardingFinancialInsightsSubtitle
source: Get detailed analytics and insights about your spending patterns
ms: Dapatkan analitik dan wawasan terperinci tentang corak perbelanjaan anda

# onboardingSecurePrivateTitle
source: Secure & Private
ms: Selamat & Peribadi

# onboardingSecurePrivateSubtitle
source: Your financial data is encrypted and stored securely on your device
ms: Data kewangan anda disulitkan dan disimpan dengan selamat di peranti anda

# onboardingCurrencyTitle
source: Choose Your Currency
ms: Pilih Mata Wang Anda

# onboardingCurrencySubtitle
source: Select your preferred currency for all transactions and calculations
ms: Pilih mata wang pilihan untuk semua transaksi dan pengiraan

source: Home
ms: Laman Utama

source: Transactions
ms: Transaksi

source: Profile
ms: Profil

source: Settings
ms: Tetapan

source: Categories
ms: Kategori

source: Report Bug
ms: Laporkan Pepijat

source: Help & Support
ms: Bantuan & Sokongan

source: About
ms: Tentang

source: Backup & Restore
ms: Sandaran & Pemulihan

source: Cashflow Manager
ms: Pengurus Cashflow

source: Manage your finances
ms: Urus kewangan anda

source: Debug Information
ms: Maklumat Debug

source: Copy Debug Info
ms: Salin Info Debug

# debugInfoCopied
source: Debug info copied to clipboard
ms: Info debug disalin ke papan keratan

# bugReportTitle
source: Report Bug
ms: Laporkan Pepijat

# bugReportSubtitle
source: Help us improve CashFlow by reporting bugs you encounter.
ms: Bantu kami menambah baik CashFlow dengan melaporkan pepijat yang anda temui.

source: Bug Description
ms: Penerangan Pepijat

# bugDescriptionRequired
source: Bug Description *
ms: Penerangan Pepijat *

# bugDescriptionHint
source: Describe what went wrong...
ms: Terangkan apa yang salah...

# bugDescriptionError
source: Please describe the bug
ms: Sila terangkan pepijat tersebut

source: Steps to Reproduce
ms: Langkah untuk Menghasilkan Semula

# stepsToReproduceRequired
source: Steps to Reproduce *
ms: Langkah untuk Menghasilkan Semula *

# stepsToReproduceHint
source: 1. Go to... 2. Click on... 3. See error...
ms: 1. Pergi ke... 2. Klik pada... 3. Lihat ralat...

# stepsToReproduceError
source: Please provide steps to reproduce
ms: Sila berikan langkah untuk menghasilkan semula

source: Expected Behavior
ms: Tingkah Laku yang Dijangka

# expectedBehaviorHint
source: What should have happened instead?
ms: Apa yang sepatutnya berlaku?

# debugInfoAutoIncluded
source: This information will be automatically included:
ms: Maklumat ini akan disertakan secara automatik:

source: App Version
ms: Versi Aplikasi

source: Build Mode
ms: Mod Build

source: Generate Bug Report
ms: Jana Laporan Pepijat

# bugReportCopied
source: Bug report copied to clipboard! You can now paste it in an email or message.
ms: Laporan pepijat disalin ke papan keratan! Anda kini boleh menampalkannya dalam emel atau mesej.

# debugModeYes
source: Yes
ms: Ya

# debugModeNo
source: No
ms: Tidak

# buildModeRelease
source: Release
ms: Keluaran

# buildModeProfile
source: Profile
ms: Profil

source: Not specified
ms: Tidak dinyatakan

source: Language
ms: Bahasa

source: Select Language
ms: Pilih Bahasa

source: English
ms: Bahasa Inggeris

source: Indonesian
ms: Bahasa Indonesia

# malaysian
source: Malay
ms: Bahasa Melayu

source: Appearance
ms: Penampilan

source: Theme
ms: Tema

source: System Default
ms: Default Sistem

source: Font Size
ms: Saiz Fon

source: Medium
ms: Sederhana

source: Data & Privacy
ms: Data & Privasi

# backupRestoreSubtitle
source: Export or import your data
ms: Eksport atau import data anda

source: Clear Data
ms: Padam Data

# clearDataSubtitle
source: Delete all your data permanently
ms: Padam semua data anda secara kekal

# clearDataConfirmation
source: Are you sure you want to clear all data? This action cannot be undone.
ms: Adakah anda pasti ingin memadam semua data? Tindakan ini tidak boleh dibatalkan.

# dataCleared
source: Data cleared successfully
ms: Data berjaya dipadam

source: Notifications
ms: Pemberitahuan

source: Enable Notifications
ms: Aktifkan Pemberitahuan

# receiveReminders
source: Receive reminders and updates
ms: Terima peringatan dan kemas kini

source: Daily Reminders
ms: Peringatan Harian

# dailyRemindersSubtitle
source: Get reminded to track expenses
ms: Dapatkan peringatan untuk jejak perbelanjaan

source: Cancel
ms: Batal

# dashboardGoodMorning
source: Good Morning!
ms: Selamat Pagi!

# dashboardWelcomeBack
source: Welcome back to your finances
ms: Selamat kembali ke kewangan anda

# dashboardTotalBalance
source: Total Balance
ms: Jumlah Baki

# dashboardTrendFromLastMonth
source: +12.5% from last month
ms: +12.5% dari bulan lalu

# dashboardIncome
source: Income
ms: Pendapatan

# dashboardExpenses
source: Expenses
ms: Perbelanjaan

# dashboardQuickActions
source: Quick Actions
ms: Tindakan Pantas

# dashboardAddIncome
source: Add Income
ms: Tambah Pendapatan

# dashboardAddExpense
source: Add Expense
ms: Tambah Perbelanjaan

# dashboardTransfer
source: Transfer
ms: Pindahan

# dashboardBudget
source: Budget
ms: Bajet

# dashboardSpendingCategories
source: Spending Categories
ms: Kategori Perbelanjaan

# dashboardChartPlaceholder
source: Chart Placeholder
ms: Placeholder Carta

# dashboardFoodDining
source: Food & Dining
ms: Makanan & Minuman

# dashboardTransportation
source: Transportation
ms: Pengangkutan

# dashboardShopping
source: Shopping
ms: Membeli-belah

# dashboardBills
source: Bills
ms: Bil

# dashboardRecentTransactions
source: Recent Transactions
ms: Transaksi Terkini

# dashboardSeeAll
source: See All
ms: Lihat Semua

# dashboardStarbucksCoffee
source: Starbucks Coffee
ms: Kopi Starbucks

# dashboardGrabTransport
source: Grab Transport
ms: Pengangkutan Grab

# dashboardSalaryDeposit
source: Salary Deposit
ms: Deposit Gaji

# dashboardMoreTransactionsSoon
source: More transactions coming soon
ms: Lebih banyak transaksi akan datang tidak lama lagi

# currencyUSD
source: US Dollar (USD)
ms: Dolar Amerika (USD)

# currencyIDR
source: Indonesian Rupiah (IDR)
ms: Rupiah Indonesia (IDR)

# currencyMYR
source: Malaysian Ringgit (MYR)
ms: Ringgit Malaysia (MYR)

# currencyGBP
source: British Pound (GBP)
ms: Pound British (GBP)

# currencyJPY
source: Japanese Yen (JPY)
ms: Yen Jepun (JPY)

# currencySGD
source: Singapore Dollar (SGD)
ms: Dolar Singapura (SGD)

source: Select Currency
ms: Pilih Mata Wang

source: Currency
ms: Mata Wang

source: Currency Settings
ms: Tetapan Mata Wang

source: Change Currency
ms: Tukar Mata Wang

source: Change Language
ms: Tukar Bahasa

source: No currencies found
ms: Mata wang tidak dijumpai

# tryAdjustingSearch
source: Try adjusting your search
ms: Cuba laraskan carian anda

source: Search currencies...
ms: Cari mata wang...

source: Budget Management
ms: Pengurusan Belanjawan

source: Budget Categories
ms: Kategori Belanjawan

source: Budget Plans
ms: Pelan Belanjawan

source: Add
ms: Tambah

source: Update
ms: Kemaskini

source: Budget Overview
ms: Gambaran Keseluruhan Belanjawan

source: Total Budget
ms: Jumlah Belanjawan

source: Spent
ms: Digunakan

source: Remaining
ms: Baki

source: Progress
ms: Kemajuan

source: Delete
ms: Padam

# budgetPeriodWeekly
source: Weekly
ms: Mingguan

# budgetPeriodMonthly
source: Monthly
ms: Bulanan

# budgetPeriodQuarterly
source: Quarterly
ms: Suku Tahunan

# budgetPeriodYearly
source: Yearly
ms: Tahunan

source: Create Budget Plan
ms: Cipta Pelan Belanjawan

source: Edit Budget Plan
ms: Edit Pelan Belanjawan

source: Plan Your Spending
ms: Rancang Perbelanjaan Anda

source: Update Your Budget
ms: Kemaskini Belanjawan Anda

# setBudgetDescription
source: Set spending limits to manage your finances better
ms: Tetapkan had perbelanjaan untuk mengurus kewangan dengan lebih baik

# modifyBudgetDescription
source: Modify your budget plan details
ms: Ubah suai butiran pelan belanjawan anda

source: Budget Name
ms: Nama Belanjawan

# budgetNameRequired
source: Please enter a budget name
ms: Sila masukkan nama belanjawan

source: Category
ms: Kategori

source: Select Category
ms: Pilih Kategori

# selectCategoryError
source: Please select a category
ms: Sila pilih kategori

source: Amount
ms: Jumlah

source: Enter amount
ms: Masukkan jumlah

source: Invalid amount
ms: Jumlah tidak sah

source: Period
ms: Tempoh

source: Select Period
ms: Pilih Tempoh

source: No Categories Available
ms: Tiada Kategori Tersedia

# createCategoriesFirst
source: Please create some categories first
ms: Sila cipta beberapa kategori terlebih dahulu

source: No Budget Plans Yet
ms: Belum Ada Pelan Belanjawan

source: Delete Budget Plan
ms: Padam Pelan Belanjawan

# budgetCreatedSuccess
source: Budget plan created successfully
ms: Pelan belanjawan berjaya dicipta

# budgetUpdatedSuccess
source: Budget plan updated successfully
ms: Pelan belanjawan berjaya dikemaskini

# budgetDeletedSuccess
source: Budget plan deleted successfully
ms: Pelan belanjawan berjaya dipadam

source: Create New Budget Plan
ms: Cipta Pelan Belanjawan Baharu

source: Sort by
ms: Susun mengikut

# sortByAmount
source: Amount
ms: Jumlah

# sortByName
source: Name
ms: Nama

# sortByDate
source: Date
ms: Tarikh

# sortByCategory
source: Category
ms: Kategori

source: Ascending
ms: Menaik

source: Descending
ms: Menurun

# setupBudgetDialog
source: Set up a new budget to track your spending
ms: Sediakan belanjawan baharu untuk menjejak perbelanjaan anda

# updateBudgetDialog
source: Update your budget plan
ms: Kemaskini pelan belanjawan anda

# categoryTypeIncome
source: Income
ms: Pendapatan

# categoryTypeExpense
source: Expense
ms: Perbelanjaan

# categoryFoodDining
source: Food & Dining
ms: Makanan & Minum

# categoryFoodDiningDesc
source: Restaurants, groceries, and food delivery
ms: Restoran, membeli-belah bahan makanan, dan perkhidmatan penghantaran

# categoryTransportation
source: Transportation
ms: Pengangkutan

# categoryTransportationDesc
source: Gas, public transport, taxi, and car maintenance
ms: Petrol, pengangkutan awam, teksi, dan penyelenggaraan kenderaan

# categoryShopping
source: Shopping
ms: Membeli-belah

# categoryShoppingDesc
source: Clothing, electronics, and general shopping
ms: Pakaian, elektronik, dan membeli-belah umum

# categoryBillsUtilities
source: Bills & Utilities
ms: Bil & Utiliti

# categoryBillsUtilitiesDesc
source: Electricity, water, internet, phone bills
ms: Elektrik, air, internet, bil telefon

# categoryHealthcare
source: Healthcare
ms: Penjagaan Kesihatan

# categoryHealthcareDesc
source: Medical expenses, pharmacy, insurance
ms: Perbelanjaan perubatan, farmasi, insurans

# categoryEntertainment
source: Entertainment
ms: Hiburan

# categoryEntertainmentDesc
source: Movies, games, subscriptions, hobbies
ms: Filem, permainan, langganan, hobi

# categoryEducation
source: Education
ms: Pendidikan

# categoryEducationDesc
source: Books, courses, tuition, school supplies
ms: Buku, kursus, yuran sekolah, bekalan sekolah

# categoryTravel
source: Travel
ms: Perjalanan

# categoryTravelDesc
source: Hotels, flights, vacation expenses
ms: Hotel, penerbangan, perbelanjaan percutian

# categorySalary
source: Salary
ms: Gaji

# categorySalaryDesc
source: Monthly salary and wages
ms: Gaji bulanan dan upah

# categoryFreelanceDesc
source: Freelance projects and gigs
ms: Projek freelance dan kerja sambilan

# categoryBusiness
source: Business
ms: Perniagaan

# categoryBusinessDesc
source: Business income and profit
ms: Pendapatan dan keuntungan perniagaan

# categoryInvestment
source: Investment
ms: Pelaburan

# categoryInvestmentDesc
source: Dividends, stock gains, crypto
ms: Dividen, keuntungan saham, kripto

# categoryBonusDesc
source: Work bonus and incentives
ms: Bonus kerja dan insentif

# categoryOtherIncome
source: Other Income
ms: Pendapatan Lain

# categoryOtherIncomeDesc
source: Other sources of income
ms: Sumber pendapatan lain

# noBudgetPlansMessage
source: Start managing your spending by creating budget plans.
ms: Mula mengurus perbelanjaan anda dengan mencipta pelan belanjawan.

source: Loading budget plans...
ms: Memuatkan pelan belanjawan...

# deleteBudgetConfirmation
source: Are you sure you want to delete "{budgetName}"? This action cannot be undone.
ms: Adakah anda pasti ingin memadam "{budgetName}"? Tindakan ini tidak boleh dibatalkan.

# pleaseSelectCategory
source: Please select a category
ms: Sila pilih kategori

source: Active Plans
ms: Pelan Aktif

# budgetNameHint
source: e.g., Monthly Groceries
ms: cth: Belanja Bulanan

# budgetNotesHint
source: Add notes about this budget...
ms: Tambah nota tentang belanjawan ini...

# budgetDescription
source: Description (Optional)
ms: Penerangan (Pilihan)

# selectCategoryWithCount
source: Select Category ({count})
ms: Pilih Kategori ({count})

source: Error
ms: Ralat

source: Add Transaction
ms: Tambah Transaksi

source: Add Income
ms: Tambah Pendapatan

source: Add Expense
ms: Tambah Perbelanjaan

# transactionTitle
source: Title
ms: Tajuk

# transactionTitleHint
source: e.g., Lunch at restaurant
ms: contoh: Makan tengah hari di restoran

# transactionTitleRequired
source: Transaction title is required
ms: Tajuk transaksi diperlukan

# transactionAmount
source: Amount
ms: Jumlah

# transactionAmountRequired
source: Amount is required
ms: Jumlah diperlukan

# transactionAmountInvalid
source: Please enter a valid amount
ms: Sila masukkan jumlah yang sah

# transactionDescription
source: Description (Optional)
ms: Penerangan (Pilihan)

# transactionDescriptionHint
source: Add notes about this transaction...
ms: Tambah nota tentang transaksi ini...

# transactionCategory
source: Category
ms: Kategori

# transactionCategoryRequired
source: Please select a category
ms: Sila pilih kategori

# transactionTypeRequired
source: Please select transaction type
ms: Sila pilih jenis transaksi

source: Others
ms: Lain-lain

# transactionDate
source: Date
ms: Tarikh

# transactionType
source: Type
ms: Jenis

source: Income
ms: Pendapatan

source: Expense
ms: Perbelanjaan

source: Budget Remaining
ms: Baki Belanjawan

# budgetOverLimit
source: Over Budget
ms: Melebihi Belanjawan

source: Budget Preview
ms: Pratonton Belanjawan

# budgetUsed
source: Used
ms: Digunakan

# budgetTotal
source: Total
ms: Jumlah

# budgetAfterTransaction
source: After this transaction
ms: Selepas transaksi ini

source: Save Transaction
ms: Simpan Transaksi

# transactionSaved
source: Transaction saved successfully!
ms: Transaksi berjaya disimpan!

# transactionSaveFailed
source: Failed to save transaction
ms: Gagal menyimpan transaksi

# filterToday
source: Today
ms: Hari Ini

# filterThisWeek
source: This Week
ms: Minggu Ini

# filterThisMonth
source: This Month
ms: Bulan Ini

# filterThisYear
source: This Year
ms: Tahun Ini

# dateToday
source: Today
ms: Hari Ini

# dateYesterday
source: Yesterday
ms: Semalam

source: Transaction Details
ms: Butiran Transaksi

source: Delete Transaction
ms: Padam Transaksi

# deleteTransactionConfirmation
source: Are you sure you want to delete this transaction?
ms: Adakah anda pasti mahu memadam transaksi ini?

# transactionDeleted
source: Transaction deleted successfully
ms: Transaksi berjaya dipadam

source: Edit Transaction
ms: Edit Transaksi

source: Budget Impact
ms: Kesan Belanjawan

source: Current Budget Usage
ms: Penggunaan Belanjawan Semasa

source: After this transaction
ms: Selepas transaksi ini

source: Budget Status
ms: Status Belanjawan

source: Within Budget
ms: Dalam Belanjawan

source: Over Budget
ms: Melebihi Belanjawan

source: Budget Plan
ms: Pelan Belanjawan

source: No budget plan
ms: Tiada pelan belanjawan

# deleteConfirmationTitle
source: Delete Transaction
ms: Padam Transaksi

# deleteConfirmationMessage
source: Are you sure you want to delete this transaction?
ms: Adakah anda pasti mahu memadam transaksi ini?

# deleteConfirmationWarning
source: This action cannot be undone.
ms: Tindakan ini tidak boleh dibatalkan.

source: All
ms: Semua

source: Balance
ms: Baki

source: Retry
ms: Cuba Lagi

source: Transaction not found
ms: Transaksi tidak ditemui

source: Details
ms: Butiran

source: Type
ms: Jenis

source: Description
ms: Penerangan

source: Time
ms: Masa

source: Budget
ms: Belanjawan

source: Timeline
ms: Garis Masa

source: Created
ms: Dicipta

source: Last Updated
ms: Kemaskini Terakhir

source: Edit functionality coming soon
ms: Fungsi edit akan datang tidak lama lagi

source: No transactions found
ms: Tiada transaksi ditemui

# tryAdjustingFilters
source: Try adjusting your search or filters
ms: Cuba laraskan carian atau penapis anda

# startAddingTransactions
source: Start adding your income and expenses
ms: Mula tambah pendapatan dan perbelanjaan anda

source: This budget is over by
ms: Belanjawan ini melebihi sebanyak

source: Select Budget
ms: Pilih Belanjawan

source: Show all transactions
ms: Tunjukkan semua transaksi

source: No Budget Plans
ms: Tiada Pelan Belanjawan

source: Select Budget Plan
ms: Pilih Pelan Belanjawan

source: Search budgets...
ms: Cari belanjawan...

source: No budgets found
ms: Tiada belanjawan ditemui

# tryAdjustingSearchTerm
source: Try adjusting your search term
ms: Cuba laraskan istilah carian anda

source: Clear search
ms: Kosongkan carian

source: Budget details loading...
ms: Memuat butiran belanjawan...

source: Calculating remaining...
ms: Mengira baki...

# budgetCount
source: {count} of {total} budgets
ms: {count} daripada {total} belanjawan

# createBudgetPlanDescription
source: To track expenses properly, you need to create budget plans first.
ms: Untuk menjejak perbelanjaan dengan betul, anda perlu mencipta pelan belanjawan dahulu.

source: What would you like to do?
ms: Apa yang anda ingin lakukan?

# createBudgetPlanToTrack
source: Create budget plans first for better expense tracking.
ms: Cipta pelan belanjawan dahulu untuk penjejakan perbelanjaan yang lebih baik.
